USE CarsRoom;

SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

CREATE PROCEDURE [Автомобиль данного типа кузова] 
	@Body_type varchar(50)
AS
BEGIN
	SET NOCOUNT ON;
	SELECT [Производители].[Наименование], [Марка], [Цвет], [Название], [Автомобили].[Цена]  FROM [Автомобили] 
		JOIN [Производители] 
		ON [Автомобили].[Код производителя] = [Производители].[Код производителя]
		JOIN [Тип кузова]
		ON [Автомобили].[Код типа кузова] = [Тип кузова].[Код типа кузова]
		JOIN [Дополнительное оборудование]
		ON [Дополнительное оборудование].[Код оборудования] = [Автомобили].[Код оборудования 1]
		JOIN [Сотрудники]
		ON [Автомобили].[Код сотрудника] = [Сотрудники].[Код сотрудника]
	WHERE ([Тип кузова].[Название] = @Body_type)
END
GO
