USE CarsRoom;

SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO

CREATE PROCEDURE [Оплаченные и неоплаченные заказы] 
	@t bit
AS
BEGIN
	SET NOCOUNT ON;
	SELECT [Заказчики].[Фамилия] AS [Заказчик], [Дата заказа], [Дата продажи], [Марка], [Цена], [Цвет], 
	[Сотрудники].[Фамилия] AS [Продавец], [Отметка об оплате]  FROM [Заказчики]
	JOIN [Автомобили]
	ON [Автомобили].[Код автомобиля] = [Заказчики].[Код автомобиля]
	JOIN [Сотрудники]
	ON [Сотрудники].[Код сотрудника] = [Заказчики].[Код сотрудника]
	WHERE ([Заказчики].[Отметка об оплате] = @t)
END
GO
